DataProcessors/абс_ПечатьКомплектаОтгрузочныхДокументов/абс_ПечатьКомплектаОтгрузочныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ПечатьКомплектаОтгрузочныхДокументов</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтгрузочныеДокументы</name>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

InformationRegisters/абс_НастройкиПечатиКомплектаОтгрузочныхДокументов/абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиПечатиКомплектаОтгрузочныхДокументов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.ВнешниеОбработки</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭкземпляровПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючПараметровПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыводитьГрузополучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидАдресаГрузополучателя</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВидАдресаДоставки</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВыводитьАдресДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПечатнойФормы</name>
    <type>
      <types>CatalogRef.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DataProcessors/абс_ПечатьКомплектаОтгрузочныхДокументов/Forms/Форма/Module.bsl
&НаКлиенте
Перем СКД;
//(леовит роман
&НаКлиенте
Перем лео_имяпринтера;
//)леовит роман

// Функция получает ТабличныйДокумент для печати из внешней печатной формы.
//
// Параметры
//  Ссылка         - Ссылка, для которой необходимо напечатать документ
//  ДвоичныеДанные - ДвоичныеДанные, внешняя обработка для печати
//
// Возвращаемое значение:
//   ТабличныйДокумент
//
&НаКлиенте
Функция НапечататьВнешнююФорму(Ссылка, ИсточникМакета) Экспорт
	
	Перем ДополнительныеПараметры;
	
	ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.Принадлежность[ИсточникМакета.НомерСтроки - 1].ХранилищеВнешнейОбработки.Получить();
	
	// Получить дополнительные параметры внешней обработки
	ИсточникМакета.Свойство("ДополнительныеПараметрыОбработки", ДополнительныеПараметры);
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = Ссылка;
		
		// Передать внешней обработке дополнительные параметры
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение
			Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
				Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент = Обработка.Печать();
		УдалитьФайлы(ИмяФайла);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось сформировать внешнюю печатную форму!");
	КонецПопытки;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция выводит на печать табличный документ.
// Открывает форму Печати документов, хаполняет печатный документ формы.
//
// Параметры:
//  ПечДокумент - ТабличныйДокумент
//  КоличествоЭкземпляров - число
//  НаПринтер - булево
//  Заголовок - строка, заголовок формы печати
//  Ссылка - Ссылка объекта печати
//
&НаКлиенте
Функция НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", Ссылка = Неопределено, ПараметрыПечДокумента = Неопределено) Экспорт
	
	Если ПечДокумент = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если НЕ ПечДокумент.АвтоМасштаб
		И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;
	
	Если ТипЗнч(НаПринтер) = Тип("Булево") Тогда
		Если НаПринтер Тогда
			ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
			
			///+ лео Роман один экземпляр для глуховой
			Если ЭтаФорма.ОдинЭкземпляр= Истина Тогда
				 КоличествоЭкземпляров=1;
			КонеЦЕсли;
			
			///+ лео Роман  один экземпляр для глуховой

			//( леовит роман
			//ПечДокумент.Напечатать();
			//) леовит роман
			//Если КоличествоЭкземпляров > 0 Тогда
		    ПечДокумент.КоличествоЭкземпляров = 1;//КоличествоЭкземпляров;
	       //КонецЕсли;
	
			//(леовит роман
			//Если КоличествоЭкземпляров > 0 Тогда
			//лео_КоличествоЭкземпляров=КоличествоЭкземпляров;
			ПечДокумент.КоличествоЭкземпляров = 1;//КоличествоЭкземпляров;
			
			//КонецЕсли;
	

			Если лео_счетчик=0 Тогда
				режимПечати=РежимИспользованияДиалогаПечати.Использовать;
				лео_счетчик=1;
			иначе
				режимПечати=РежимИспользованияДиалогаПечати.НеИспользовать;
				ПечДокумент.ИмяПринтера=лео_имяпринтера;
			КонеЦЕсли;
			ПечДокумент.Напечатать(режимПечати);
			лео_КоличествоЭкземпляров=1; //уже напечатано
			Если лео_счетчик=0 Тогда
				лео_имяпринтера=ПечДокумент.ИмяПринтера;
			КонеЦЕсли;
			
			//т.к в пдф креейтер печатаются  криво, допечатаем оставшиеся копии
			Пока лео_КоличествоЭкземпляров< КоличествоЭкземпляров Цикл
				режимПечати=РежимИспользованияДиалогаПечати.НеИспользовать;
				ПечДокумент.Напечатать(режимПечати);
				лео_КоличествоЭкземпляров=лео_КоличествоЭкземпляров+1;
			КонеЦЦикла;
			
			
			
			
			
			//)леовит роман
			
			
			
			УстановитьПризнакДокументыНапечатаны(Ссылка);
		Иначе
			ФормаПечати = ПолучитьОбщуюФорму("ПечатьДокументов",, Новый УникальныйИдентификатор);
			ФормаПечати.ОбъектПечати     = Ссылка;
			ФормаПечати.ПечатныйДокумент = ПечДокумент;
			ФормаПечати.Заголовок        = Заголовок;
			ФормаПечати.Защита           = УправлениеДопПравамиПользователей.ЗащитаТаблиц();
			ФормаПечати.ПараметрыПечатногоДокумента		= ПараметрыПечДокумента;
			ФормаПечати.Открыть();
			Возврат ФормаПечати;
		КонецЕсли;
	ИначеЕсли ТипЗнч(НаПринтер) = Тип("Массив") Тогда
		ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
		//(леовит роман
		//ПечДокумент.Напечатать();
		//)
		///(леовит роман
			Если лео_счетчик=0 Тогда
				режимПечати=РежимИспользованияДиалогаПечати.Использовать;
				лео_счетчик=1;
			иначе
				режимПечати=РежимИспользованияДиалогаПечати.НеИспользовать;
				ПечДокумент.ИмяПринтера=лео_имяпринтера;
			КонеЦЕсли;
			ПечДокумент.Напечатать(режимПечати);
			Если лео_счетчик=0 Тогда
            лео_имяпринтера=ПечДокумент.ИмяПринтера;
			КонеЦЕсли;
			//)леовит роман

		НаПринтер.Добавить(ПечДокумент);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // НапечататьДокумент()

&НаСервере
Процедура УстановитьПризнакДокументыНапечатаны(Ссылка)
	
	Если Не Ссылка.абс_СформированКомплектОтгрузочныхДокументов Тогда
		РеализацияОбъект = Ссылка.ПолучитьОбъект();
		РеализацияОбъект.абс_СформированКомплектОтгрузочныхДокументов = Истина;
		РеализацияОбъект.ОбменДанными.Загрузка = Истина;
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.ОтгрузочныеДокументы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузочныеДокументы_ЗаполнитьПоОтбору(Команда)
	Если Вопрос("При заполнении данные таблицы будут удалены! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//ОтгрузочныеДокументы_ЗаполнитьПоОтборуСервер();
		
		ОтгрузочныйДокументы_ЗаполнитьПоКомпоновщикуОтбора();
		ЗаполнитьТипыПечатныхФорм();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыПечатныхФорм()
	
	ТипыПечФорм = РеквизитФормыВЗначение("ТипыПечатныхФорм");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Контрагент
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Реализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы КАК ТипПечатнойФормы,
	|	ИСТИНА КАК Пометка
	|ИЗ
	|	Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних КАК абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних
	|		ПО (Контрагенты.Контрагент = абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Контрагент
	|				ИЛИ абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы.Наименование";

	тзОтгрузочныеДокументы = Объект.ОтгрузочныеДокументы.Выгрузить(,"РеализацияТоваровУслуг");
	
	Запрос.УстановитьПараметр("Реализации"		, тзОтгрузочныеДокументы.ВыгрузитьКолонку("РеализацияТоваровУслуг"));	
	
	ТипыПечФорм = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТипыПечФорм, "ТипыПечатныхФорм");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиКомпоновщикаОтбораДокументов()
	
	//  СКД = Новый СхемаКомпоновкиДанных;
	//
	//ИД = СКД.ИсточникиДанных.Добавить();
	//ИД.Имя 					= "Источник";
	//ИД.ТипИсточникаДанных 	= "Local";
	//
	//НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//НаборДанных.Имя 						= "Запрос";
	//НаборДанных.Запрос						= "ВЫБРАТЬ * ИЗ Документ.РеализацияТоваровУслуг";
	//НаборДанных.ИсточникДанных 				= "Источник";
	//НаборДанных.АвтоЗаполнениеДоступныхПолей= Истина;
	//
	//КомпоновщикОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));	
	
	УстановитьНастройкиКомпоновщикаОтбораДокументовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиКомпоновщикаОтбораДокументовНаСервере()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	СКД = ЭтотОбъект.ПолучитьМакет("МакетСхемыОтрузочныхДокументов");
	
	АдресСхемыПродаж = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыПродаж));
	КомпоновщикОтбора.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузочныйДокументы_ЗаполнитьПоКомпоновщикуОтбора()
	
	ОтгрузочныйДокументы_ЗаполнитьПоКомпоновщикуОтбораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтгрузочныйДокументы_ЗаполнитьПоКомпоновщикуОтбораНаСервере()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	СКД = ЭтотОбъект.ПолучитьМакет("МакетСхемыОтрузочныхДокументов");	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновщика = КомпоновщикМакета.Выполнить(СКД, КомпоновщикОтбора.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновщика);
	
	ТЗ = Новый ТаблицаЗначений;	
	ТЗ.Колонки.Добавить("Ссылка");
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки , Истина);
	
	Объект.ОтгрузочныеДокументы.Очистить();
	
	Для Каждого СтрТЗ из ТЗ Цикл
		НоваяСтрока = Объект.ОтгрузочныеДокументы.Добавить();
		НоваяСтрока.РеализацияТоваровУслуг = СтрТЗ.Ссылка;
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.СчетФактура =	УчетНДС.НайтиПодчиненныйСчетФактуру(СтрТЗ.Ссылка, "СчетФактураВыданный");
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОтгрузочныеДокументы_ЗаполнитьПоОтборуСервер()
	
	Объект.ОтгрузочныеДокументы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|	И РеализацияТоваровУслуг.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(Объект.НачалоПериода), Объект.НачалоПериода, '00010101'));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(Объект.ОкончаниеПериода), Объект.ОкончаниеПериода, '39990101'));
	Если Объект.Контрагент.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслуг.Контрагент = &Контрагент", "");
	Иначе
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = Объект.ОтгрузочныеДокументы.Добавить();
		СтрокаТЧ.РеализацияТоваровУслуг = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузочныеДокументы_Подбор(Команда)
	//откроем форму подбора заказа
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаВыбора", ПараметрыПодбора, Элементы.ОтгрузочныеДокументы);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузочныеДокументы_Сформировать(Команда)
	
	ОтгрузочныеДокументы_СформироватьСервер();
	
	//ЗаполнитьТаблицуПечатныхФормСервер();
	
	Для Каждого СтрокаРеализации Из ДеревоДокументов.ПолучитьЭлементы() Цикл
		СтрокаРеализации.Пометка = Ложь;
		ТекРеализация = СтрокаРеализации.Документ;
		Для Каждого СтрокаФормы Из СтрокаРеализации.ПолучитьЭлементы() Цикл
			
			СтруктураПараметров = Новый Структура;
			
			СтруктураПараметров.Вставить("СсылкаНаВнешнююОбработку",СтрокаФормы.СсылкаНаВнешнююОбработку);
			СтруктураПараметров.Вставить("НомерСтроки",1); //допущение, что во внешней обработке в таб. части Принадлежность - 1 строка.
			
			СтруктураДопПараметров = Новый Структура();
			
			СтруктураДопПараметров.Вставить("КлючПараметровПечати"		, СтрокаФормы.КлючПараметровПечати);
			
			СтруктураДопПараметров.Вставить("ВыводитьГрузополучателя"	, СтрокаФормы.ВыводитьГрузополучателя);
			СтруктураДопПараметров.Вставить("ВидАдресаГрузополучателя"	, СтрокаФормы.ВидАдресаГрузополучателя);
			СтруктураДопПараметров.Вставить("ВидАдресаДоставки"			, СтрокаФормы.ВидАдресаДоставки);
			СтруктураДопПараметров.Вставить("ВыводитьАдресДоставки"		, СтрокаФормы.ВыводитьАдресДоставки);
			
			///+ лео роман
			СтруктураДопПараметров.Вставить("БезПодписей"		, ЭтаФорма.НаМолком);
            
			///+лео роман
			
			//СтруктураПараметров.Вставить("ДополнительныеПараметрыОбработки",Новый Структура("КлючПараметровПечати",СтрокаФормы.КлючПараметровПечати));
			СтруктураПараметров.Вставить("ДополнительныеПараметрыОбработки", СтруктураДопПараметров);
			
			Если НЕ СтрокаФормы.СсылкаНаВнешнююОбработку.Пустая() Тогда
				ТабДокумент = НапечататьВнешнююФорму(ТекРеализация, СтруктураПараметров);
			Иначе
				ТабДокумент = Неопределено;
			КонецЕсли;
			
			////{zhiga ОКК для УК
			//ФлагОКК = Ложь; 
			////Если ТипЗнч(ТабДокумент) = Тип("Массив") тогда 
			//Если СтрокаФормы.Документ.Наименование = "93_Удостоверение качества" тогда 
			//	ФлагОКК = Истина;
			//	Если ТабДокумент.Количество() > 0 тогда
			//		ТабДокумент = ТабДокумент[0]; 
			//	иначе
			//		ТабДокумент = Новый ТабличныйДокумент;
			//	КонецЕсли;
			//КонецЕсли; 
			////zhiga ОКК для УК}
			
			Если ТабДокумент <> Неопределено Тогда
				ТабДокумент.Защита = Ложь;
				ТабДокумент.ТолькоПросмотр = Ложь;
			КонецЕсли;
			СписокТабличныхДокументов.Добавить(ТабДокумент);
			
			СтрокаФормы.Пометка = ТабДокумент <> Неопределено;
			Если СтрокаФормы.Пометка Тогда
				СтрокаРеализации.Пометка = Истина;
			КонецЕсли;
			
			//Если ФлагОКК тогда СтрокаФормы.Пометка = Ложь КонецЕсли; //{zhiga ОКК для УК}
			
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.Пакеты.Доступность = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.Пакеты;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПечатныхФормСервер()
	
	ТЗПечатныхФорм = РеквизитФормыВЗначение("ТипыПечатныхФорм");
	ТЗПечатныхФорм.Очистить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоДокументов");
	
	Для каждого СтрокаРеализации из Дерево.Строки Цикл
		Для каждого СтрокаФормы из СтрокаРеализации.Строки  Цикл
			Если ТЗПечатныхФорм.Найти(СтрокаФормы.Документ) = Неопределено Тогда
				НоваяСтрока = ТЗПечатныхФорм.Добавить();
				НоваяСтрока.ТипПечатнойФормы = СтрокаФормы.Документ;
				НоваяСтрока.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗПечатныхФорм, "ТипыПечатныхФорм");
	
КонецПроцедуры

&НаСервере
Процедура ОтгрузочныеДокументы_СформироватьСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	0 КАК Приоритет,
	//|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	//|	НастройкиПечати.ТипПечатнойФормы КАК ТипПечатнойФормы,
	//|	НастройкиПечати.Использовать КАК Использовать,
	//|	НастройкиПечати.ПечатнаяФорма КАК ПечатнаяФорма,
	//|	НастройкиПечати.КоличествоЭкземпляровПечати КАК КоличествоЭкземпляровПечати,
	//|	НастройкиПечати.КлючПараметровПечати КАК КлючПараметровПечати,
	//|	РеализацияТоваровУслуг.Дата КАК Дата,
	//|	НастройкиПечати.ВыводитьГрузополучателя КАК ВыводитьГрузополучателя,
	//|	НастройкиПечати.ВидАдресаГрузополучателя КАК ВидАдресаГрузополучателя,
	//|	НастройкиПечати.ВидАдресаДоставки КАК ВидАдресаДоставки,
	//|	НастройкиПечати.ВыводитьАдресДоставки КАК ВыводитьАдресДоставки
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних(&КонецПериода, ) КАК НастройкиПечати
	//|		ПО РеализацияТоваровУслуг.Контрагент = НастройкиПечати.Контрагент
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Ссылка В(&Реализации)
	//|	И НастройкиПечати.Использовать
	//|	И НастройкиПечати.ТипПечатнойФормы В(&МассивПФ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	1,
	//|	РеализацияТоваровУслуг.Ссылка,
	//|	НастройкиПечати.ТипПечатнойФормы,
	//|	НастройкиПечати.Использовать,
	//|	НастройкиПечати.ПечатнаяФорма,
	//|	НастройкиПечати.КоличествоЭкземпляровПечати,
	//|	НастройкиПечати.КлючПараметровПечати,
	//|	РеализацияТоваровУслуг.Дата,
	//|	НастройкиПечати.ВыводитьГрузополучателя,
	//|	НастройкиПечати.ВидАдресаГрузополучателя,
	//|	НастройкиПечати.ВидАдресаДоставки,
	//|	НастройкиПечати.ВыводитьАдресДоставки
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
	//|	РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних(&КонецПериода, ) КАК НастройкиПечати
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Ссылка В(&Реализации)
	//|	И НастройкиПечати.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|	И НастройкиПечати.Использовать
	//|	И НастройкиПечати.ТипПечатнойФормы В(&МассивПФ)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата,
	//|   Ссылка,
	//|	ТипПечатнойФормы,
	//|	Приоритет
	//|ИТОГИ ПО
	//|	Ссылка";
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Приоритет КАК Приоритет,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ТипПечатнойФормы,
	|	ВложенныйЗапрос.Использовать,
	|	ВложенныйЗапрос.ПечатнаяФорма,
	|	ВложенныйЗапрос.КоличествоЭкземпляровПечати,
	|	ВложенныйЗапрос.КлючПараметровПечати,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.ВыводитьГрузополучателя,
	|	ВложенныйЗапрос.ВидАдресаГрузополучателя,
	|	ВложенныйЗапрос.ВидАдресаДоставки,
	|	ВложенныйЗапрос.ВыводитьАдресДоставки,
	|	ВложенныйЗапрос.ТипПечатнойФормы.Наименование КАК ТипПечатнойФормыНаименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК Приоритет,
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|		НастройкиПечати.ТипПечатнойФормы КАК ТипПечатнойФормы,
	|		НастройкиПечати.Использовать КАК Использовать,
	|		НастройкиПечати.ПечатнаяФорма КАК ПечатнаяФорма,
	|		НастройкиПечати.КоличествоЭкземпляровПечати КАК КоличествоЭкземпляровПечати,
	|		НастройкиПечати.КлючПараметровПечати КАК КлючПараметровПечати,
	|		РеализацияТоваровУслуг.Дата КАК Дата,
	|		НастройкиПечати.ВыводитьГрузополучателя КАК ВыводитьГрузополучателя,
	|		НастройкиПечати.ВидАдресаГрузополучателя КАК ВидАдресаГрузополучателя,
	|		НастройкиПечати.ВидАдресаДоставки КАК ВидАдресаДоставки,
	|		НастройкиПечати.ВыводитьАдресДоставки КАК ВыводитьАдресДоставки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних(&КонецПериода, ) КАК НастройкиПечати
	|			ПО РеализацияТоваровУслуг.Контрагент = НастройкиПечати.Контрагент
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка В(&Реализации)
	|		И НастройкиПечати.Использовать
	|		И НастройкиПечати.ТипПечатнойФормы В(&МассивПФ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		1,
	|		РеализацияТоваровУслуг.Ссылка,
	|		НастройкиПечати.ТипПечатнойФормы,
	|		НастройкиПечати.Использовать,
	|		НастройкиПечати.ПечатнаяФорма,
	|		НастройкиПечати.КоличествоЭкземпляровПечати,
	|		НастройкиПечати.КлючПараметровПечати,
	|		РеализацияТоваровУслуг.Дата,
	|		НастройкиПечати.ВыводитьГрузополучателя,
	|		НастройкиПечати.ВидАдресаГрузополучателя,
	|		НастройкиПечати.ВидАдресаДоставки,
	|		НастройкиПечати.ВыводитьАдресДоставки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
	|		РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних(&КонецПериода, ) КАК НастройкиПечати
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка В(&Реализации)
	|		И НастройкиПечати.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		И НастройкиПечати.Использовать
	|		И НастройкиПечати.ТипПечатнойФормы В(&МассивПФ)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	ТипПечатнойФормыНаименование,
	|	Приоритет
	|ИТОГИ ПО
	|	Ссылка";

	
	Реализации = Новый Массив;
	
	Для каждого СтрокаТЗ Из Объект.ОтгрузочныеДокументы Цикл
		Если СтрокаТЗ.Пометка Тогда
			Реализации.Добавить(СтрокаТЗ.РеализацияТоваровУслуг);
		КонецЕсли;
	КонецЦикла;
	//тзОтгрузочныеДокументы = Объект.ОтгрузочныеДокументы.Выгрузить(,"РеализацияТоваровУслуг");
	
	//Запрос.УстановитьПараметр("Реализации"		, тзОтгрузочныеДокументы.ВыгрузитьКолонку("РеализацияТоваровУслуг"));
	Запрос.УстановитьПараметр("Реализации", Реализации);
	// << Горбунов выбираем дату печатной формы по дате последнего документа.
	ДатаАктуальностиМакетовПечати = Реализации[Реализации.Количество() - 1].Дата;
	Запрос.УстановитьПараметр("КонецПериода"	, ?(ЗначениеЗаполнено(Объект.ОкончаниеПериода), Объект.ОкончаниеПериода, ДатаАктуальностиМакетовПечати));
	//Запрос.УстановитьПараметр("КонецПериода"	, ?(ЗначениеЗаполнено(Объект.ОкончаниеПериода), Объект.ОкончаниеПериода, '39990101'));
	// >> Горбунов выбираем дату печатной формы по дате последнего документа.
	
	ТипыПФ = РеквизитФормыВЗначение("ТипыПечатныхФорм");
	МассивСтрок = ТипыПФ.НайтиСтроки(Новый Структура("Пометка", Истина));
	МассивПФ = Новый Массив;
	Для каждого СтрокаТЗ из МассивСтрок Цикл
		МассивПФ.Добавить(СтрокаТЗ.ТипПечатнойФормы);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивПФ", МассивПФ);
	
	Дерево = РеквизитФормыВЗначение("ДеревоДокументов");
	Дерево.Строки.Очистить();
	СписокТабличныхДокументов.Очистить();
	Сч = 0;
	
	ВыборкаРеализации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРеализации.Следующий() Цикл
		
		СтрокаРеализации = Дерево.Строки.Добавить();
		СтрокаРеализации.Документ 			= ВыборкаРеализации.Ссылка;
		СтрокаРеализации.Пометка 			= Истина;
		СтрокаРеализации.НомерСтрокиСписка 	= -1;      
		
		//Если ВыборкаРеализации.Ссылка.Организация=Справочники.Организации.НайтиПоКоду("О00000002") Тогда
		//	//задание Щербининой, по лефЭкспо печатается СФ и Торг 12
		//	
		//	ВыборкаПечатныеФормы = ВыборкаРеализации.Выбрать();
		//	Пока ВыборкаПечатныеФормы.СледующийПоЗначениюПоля("ТипПечатнойФормы") Цикл  
		//		
		//		
		//		Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("6_1_Счет-фактура") > 0 Тогда
		//			СтрокаФормы = СтрокаРеализации.Строки.Добавить();
		//			СтрокаФормы.Документ 						= ВыборкаПечатныеФормы.ТипПечатнойФормы;
		//			СтрокаФормы.Пометка 						= Истина;
		//			СтрокаФормы.НомерСтрокиСписка 				= Сч;
		//			//СтрокаФормы.КоличествоЭкземпляровПечати 	= ПодобратьКоличествоДляПечати_ЭДО(СтрокаРеализации.Документ.Контрагент, ВыборкаПечатныеФормы.ТипПечатнойФормы, ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати, ВыборкаПечатныеФормы.Приоритет);
		//			СтрокаФормы.КоличествоЭкземпляровПечати 	= 1;
		//			СтрокаФормы.СсылкаНаВнешнююОбработку 		= ВыборкаПечатныеФормы.ПечатнаяФорма;
		//			СтрокаФормы.КлючПараметровПечати 			= ВыборкаПечатныеФормы.КлючПараметровПечати;
		//			СтрокаФормы.ВидАдресаГрузополучателя        = ВыборкаПечатныеФормы.ВидАдресаГрузополучателя;
		//			СтрокаФормы.ВидАдресаДоставки               = ВыборкаПечатныеФормы.ВидАдресаДоставки;
		//			СтрокаФормы.ВыводитьГрузополучателя         = ВыборкаПечатныеФормы.ВыводитьГрузополучателя;
		//			СтрокаФормы.ВыводитьАдресДоставки	        = ВыборкаПечатныеФормы.ВыводитьАдресДоставки;
		//		КонецЕсли;	
		//		Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("5_Товарная накладная") > 0 Тогда
		//			СтрокаФормы = СтрокаРеализации.Строки.Добавить();
		//			СтрокаФормы.Документ 						= ВыборкаПечатныеФормы.ТипПечатнойФормы;
		//			СтрокаФормы.Пометка 						= Истина;
		//			СтрокаФормы.НомерСтрокиСписка 				= Сч;
		//			//СтрокаФормы.КоличествоЭкземпляровПечати 	= ПодобратьКоличествоДляПечати_ЭДО(СтрокаРеализации.Документ.Контрагент, ВыборкаПечатныеФормы.ТипПечатнойФормы, ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати, ВыборкаПечатныеФормы.Приоритет);
		//			СтрокаФормы.КоличествоЭкземпляровПечати 	= 1;
		//			СтрокаФормы.СсылкаНаВнешнююОбработку 		= ВыборкаПечатныеФормы.ПечатнаяФорма;
		//			СтрокаФормы.КлючПараметровПечати 			= ВыборкаПечатныеФормы.КлючПараметровПечати;
		//			СтрокаФормы.ВидАдресаГрузополучателя        = ВыборкаПечатныеФормы.ВидАдресаГрузополучателя;
		//			СтрокаФормы.ВидАдресаДоставки               = ВыборкаПечатныеФормы.ВидАдресаДоставки;
		//			СтрокаФормы.ВыводитьГрузополучателя         = ВыборкаПечатныеФормы.ВыводитьГрузополучателя;
		//			СтрокаФормы.ВыводитьАдресДоставки	        = ВыборкаПечатныеФормы.ВыводитьАдресДоставки;
		//		КонецЕсли;	
		//		Сч = Сч + 1;
		//	КонецЦикла;
		//	Продолжить;
		//КонецЕсли;	 
		//Проверяет наличие печати Торг и СФ
		ПечататьУПД_=Ложь; 
		//
		ВыборкаПечатныеФормы = ВыборкаРеализации.Выбрать();
		Пока ВыборкаПечатныеФормы.СледующийПоЗначениюПоля("ТипПечатнойФормы") Цикл
			Если (ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("5_Товарная накладная") И ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати = 0) Тогда
				 ПечататьУПД_=Истина;
		    КонецЕсли;
			Если ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати = 0 Тогда
				 Продолжить;
			 КонецЕсли;	
			//{Лео Катанович  - 08.02.2017 по просьбе Глуховой С.Л. (перестали обмениваться с контрагентом некоторыми видами печатных форм) 
			////////////////////////////////////////////
			Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("9_2_Транспортная накладная") > 0 Тогда
				ПечататьТТН_Значение = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(ВыборкаПечатныеФормы.Ссылка.Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПечататьТН"));
				ПечататьТТН = ?(ЗначениеЗаполнено(ПечататьТТН_Значение), ПечататьТТН_Значение, Ложь);     // по умолчанию НЕ печатаем

				Если НЕ ПечататьТТН Тогда
					 Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("6_1_Счет-фактура") > 0 Тогда
				ПечататьСФ_Значение = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(ВыборкаПечатныеФормы.Ссылка.Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПечататьСФ"));
				ПечататьСФ = ?(ЗначениеЗаполнено(ПечататьСФ_Значение), ПечататьСФ_Значение, Истина);   // по умолчанию печатаем
				Если НЕ ПечататьСФ Тогда
					 Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("5_Товарная накладная") > 0 Тогда
				ПечататьТорг12_Значение = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(ВыборкаПечатныеФормы.Ссылка.Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПечататьТорг12"));
				ПечататьТорг12 = ?(ЗначениеЗаполнено(ПечататьТорг12_Значение), ПечататьТорг12_Значение, Истина);    // по умолчанию печатаем

				Если НЕ ПечататьТорг12 Тогда
					 Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			Если ВыборкаПечатныеФормы.ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("6_3_УПД") И НЕ ПечататьУПД_ Тогда 
				Если ВыборкаПечатныеФормы.Приоритет=1 И	ПроверитьПечать(ВыборкаПечатныеФормы.Ссылка.Контрагент,ВыборкаПечатныеФормы.Приоритет) Тогда
					 Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
            //Лео Катанович}
			СтрокаФормы = СтрокаРеализации.Строки.Добавить();
			СтрокаФормы.Документ 						= ВыборкаПечатныеФормы.ТипПечатнойФормы;
			СтрокаФормы.Пометка 						= Истина;
			СтрокаФормы.НомерСтрокиСписка 				= Сч;
			СтрокаФормы.КоличествоЭкземпляровПечати 	= ПодобратьКоличествоДляПечати_ЭДО(СтрокаРеализации.Документ.Контрагент, ВыборкаПечатныеФормы.ТипПечатнойФормы, ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати, ВыборкаПечатныеФормы.Приоритет);
			//СтрокаФормы.КоличествоЭкземпляровПечати 	= ВыборкаПечатныеФормы.КоличествоЭкземпляровПечати;
			СтрокаФормы.СсылкаНаВнешнююОбработку 		= ВыборкаПечатныеФормы.ПечатнаяФорма;
			СтрокаФормы.КлючПараметровПечати 			= ВыборкаПечатныеФормы.КлючПараметровПечати;
			СтрокаФормы.ВидАдресаГрузополучателя        = ВыборкаПечатныеФормы.ВидАдресаГрузополучателя;
			СтрокаФормы.ВидАдресаДоставки               = ВыборкаПечатныеФормы.ВидАдресаДоставки;
			СтрокаФормы.ВыводитьГрузополучателя         = ВыборкаПечатныеФормы.ВыводитьГрузополучателя;
			СтрокаФормы.ВыводитьАдресДоставки	        = ВыборкаПечатныеФормы.ВыводитьАдресДоставки;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузочныеДокументыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	НоваяСтрока = Объект.ОтгрузочныеДокументы.Добавить();
	НоваяСтрока.РеализацияТоваровУслуг = ВыбранноеЗначение;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоДокументовПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ТабДок.Очистить();
		Возврат;
	КонецЕсли;
	Если Элемент.ТекущиеДанные.НомерСтрокиСписка = -1 Тогда
		//ТабДок.Очистить();
		Возврат;
	КонецЕсли;
	Значение = ПолучитьТабличныйДокументПоНомеру(Элемент.ТекущиеДанные.НомерСтрокиСписка);
	Если Значение = Неопределено Тогда
		ТабДок.Очистить();
	Иначе
		ТабДок = Значение;
	КонецЕсли;
	
	ТабДокНомерСтрокиСписка = Элемент.ТекущиеДанные.НомерСтрокиСписка; // zhiga
	
КонецПроцедуры

//&НаСервере
&НаКлиенте
Функция ПолучитьТабличныйДокументПоНомеру(Номер)
	ЭлементСписка = СписокТабличныхДокументов.Получить(Номер);
	Возврат ЭлементСписка.Значение;
КонецФункции


&НаКлиенте
Процедура Пакеты_Печать(Команда)
	
	Для Каждого СтрокаРеализации Из ДеревоДокументов.ПолучитьЭлементы() Цикл
		ТекРеализация = СтрокаРеализации.Документ;
		Для Каждого СтрокаФормы Из СтрокаРеализации.ПолучитьЭлементы() Цикл
			
		//Если СокрЛП(СтрокаФормы.Документ) = "93_Удостоверение качества" тогда //{zhiga ОКК для УК}
		//	продолжить;
		//Конецесли;	

			
			Если СтрокаФормы.Пометка Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаФормы.НомерСтрокиСписка);
				Если Не ТекТабДокумент = Неопределено Тогда
					
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("Автомасштаб"			, Истина);
					ПараметрыПечати.Вставить("ОтображатьЗаголовки"	, Ложь);
					ПараметрыПечати.Вставить("ОтображатьСетку"		, Ложь);
					ПараметрыПечати.Вставить("ТолькоПросмотр"		, Истина);
					ПараметрыПечати.Вставить("Защита"				, Ложь);
					ПараметрыПечати.Вставить("ИмяПараметровПечати"	, "");
					
					НапечататьДокумент(ТекТабДокумент, СтрокаФормы.КоличествоЭкземпляровПечати, Объект.СразуНаПринтер, Строка(ТекРеализация), ТекРеализация, ПараметрыПечати);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	//// {zhiga ОКК для УК
	//// Удостоверение качества 
	//Для Каждого СтрокаФормы Из СтрокаРеализации.ПолучитьЭлементы() Цикл
	//	
	//	Если СокрЛП(СтрокаФормы.Документ) <> "93_Удостоверение качества" тогда
	//		продолжить;
	//	Конецесли;	
	//	Если НЕ СтрокаФормы.Пометка тогда
	//		продолжить;
	//	Конецесли;	
	//	
	//	СтруктураПараметров = Новый Структура;
	//	
	//	СтруктураПараметров.Вставить("СсылкаНаВнешнююОбработку",СтрокаФормы.СсылкаНаВнешнююОбработку);
	//	СтруктураПараметров.Вставить("НомерСтроки",1); //допущение, что во внешней обработке в таб. части Принадлежность - 1 строка.
	//	
	//	СтруктураДопПараметров = Новый Структура();
	//	
	//	СтруктураДопПараметров.Вставить("КлючПараметровПечати"		, СтрокаФормы.КлючПараметровПечати);
	//	
	//	СтруктураДопПараметров.Вставить("ВыводитьГрузополучателя"	, СтрокаФормы.ВыводитьГрузополучателя);
	//	СтруктураДопПараметров.Вставить("ВидАдресаГрузополучателя"	, СтрокаФормы.ВидАдресаГрузополучателя);
	//	СтруктураДопПараметров.Вставить("ВидАдресаДоставки"			, СтрокаФормы.ВидАдресаДоставки);
	//	СтруктураДопПараметров.Вставить("ВыводитьАдресДоставки"		, СтрокаФормы.ВыводитьАдресДоставки);
	//	
	//	///+ лео роман
	//	СтруктураДопПараметров.Вставить("БезПодписей"		, ЭтаФорма.НаМолком);
	//	СтруктураДопПараметров.Вставить("Печатать"		    , Истина);
	//	СтруктураДопПараметров.Вставить("СразуНаПринтер"    , Объект.СразуНаПринтер);

	//	///+лео роман
	//	
	//	//СтруктураПараметров.Вставить("ДополнительныеПараметрыОбработки",Новый Структура("КлючПараметровПечати",СтрокаФормы.КлючПараметровПечати));
	//	СтруктураПараметров.Вставить("ДополнительныеПараметрыОбработки", СтруктураДопПараметров);
	//	
	//	Если НЕ СтрокаФормы.СсылкаНаВнешнююОбработку.Пустая() Тогда
	//		мТабДокумент = НапечататьВнешнююФорму(ТекРеализация, СтруктураПараметров);
	//		Если мТабДокумент <> неопределено тогда
	//			ТекРеализация = СтрокаРеализации.Документ;
	//			Для каждого ТекТабДокумент из мТабДокумент цикл
	//				НапечататьДокумент(ТекТабДокумент, СтрокаФормы.КоличествоЭкземпляровПечати, Объект.СразуНаПринтер, Строка(ТекРеализация), ТекРеализация, ПараметрыПечати);
	//			КонецЦикла;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//// zhiga ОКК для УК}
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	Для Каждого ЭлементДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = ТекущиеДанные.Пометка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокПриИзменении(Элемент)
	ТекущиеДанныеДерева = Элементы.ДеревоДокументов.ТекущиеДанные;	
	//Если ТекущиеДанныеДерева.НомерСтрокиСписка <> -1 Тогда
	
	Если ТекущиеДанныеДерева.НомерСтрокиСписка <> -1 И ТекущиеДанныеДерева.НомерСтрокиСписка <> ТабДокНомерСтрокиСписка Тогда // zhiga

		УстановитьТабличныйДокументПоНомеру(ТабДок, ТекущиеДанныеДерева.НомерСтрокиСписка);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьТабличныйДокументПоНомеру(тдДокумент, Номер)
	СписокТабличныхДокументов[Номер].Значение = тдДокумент;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Пакеты.Доступность = ЛОЖЬ;
	
	Если Объект.ОтгрузочныеДокументы.Количество() > 0 Тогда
		ЗаполнитьТипыПечатныхФорм();
		ОтгрузочныеДокументы_Сформировать(Неопределено);
	КонецЕсли;
	
	УстановитьНастройкиКомпоновщикаОтбораДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Стр = Объект.ОтгрузочныеДокументы.Добавить();
	
	
	мРеализации = Неопределено;
	Если Параметры.Свойство("мРеализации", мРеализации) = Истина Тогда
		
		//Если ТипЗнч(мРеализации) = Тип("Массив") ТОгда
		//	обОбработка = РеквизитФормыВЗначение("Объект");
		//	Для Каждого Элемент Из мРеализации Цикл
		//		СтрокаТЧ = обОбработка.ОтгрузочныеДокументы.Добавить();
		//		СтрокаТЧ.РеализацияТоваровУслуг 	= Элемент;
		//		СтрокаТЧ.Пометка 					= Истина;
		//	КонецЦикла;
		//	ЗначениеВРеквизитФормы(обОбработка, "Объект");
		//КонецЕсли;
		
		
		Объект.ОтгрузочныеДокументы.Очистить();
		Если ТипЗнч(мРеализации) = Тип("Массив") ТОгда
			
			Для Каждого Элемент Из мРеализации Цикл
				НоваяСтрока = Объект.ОтгрузочныеДокументы.Добавить();
				НоваяСтрока.РеализацияТоваровУслуг 	= Элемент;
				НоваяСтрока.Пометка 				= Истина;
				//+Лео Сафонов ЕА
				НоваяСтрока.СчетФактура  = УчетНДС.НайтиПодчиненныйСчетФактуру(Элемент, "СчетФактураВыданный"); 
				//-Лео Сафонов ЕА
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
	//УстановитьНастройкиКомпоновщикаОтбораДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументов_Выгрузить(Команда)
	
	ТекДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	
	Если ТекРодитель <> Неопределено Тогда
		Если ТекДанные.СсылкаНаВнешнююОбработку.Пустая() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указана внешняя печатная форма, выгрузка невозможна!",, "Не удалось сформировать файл выгрузки!");
			Возврат;
		КонецЕсли;
		
		СтруктураФайла = ВыгрузитьФайлОбмена(ТекРодитель.Документ, ТекДанные.СсылкаНаВнешнююОбработку);
		Если СтруктураФайла.АдресХранилища <> Неопределено Тогда
			ПолучитьФайл(СтруктураФайла.АдресХранилища, СтруктураФайла.ИмяФайла);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Выберите в дереве элементов печатную форму товарной накладной!",, "Не удалось сформировать файл выгрузки!");	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВыгрузитьФайлОбмена(Ссылка, ссОбработка)
	
	ДвоичныеДанные = ссОбработка.Принадлежность[0].ХранилищеВнешнейОбработки.Получить();
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ссОбработка.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	сАдресХранилища = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		обОбработка = ВнешниеОбработки.Создать(ИмяФайла);
		обОбработка.СсылкаНаОбъект = Ссылка;
		
		сАдресХранилища = обОбработка.ВыгрузитьФайлОбмена();
		
		УдалитьФайлы(ИмяФайла);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("У внешней печатной формы нет метода ""ВыгрузитьФайлОбмена"", выгрузка невозможна!",, "Не удалось сформировать файл выгрузки!");
	КонецПопытки;
	
	Возврат сАдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура ТипыПечатныхФормПометкаПриИзменении(Элемент)
	
	Для каждого СтрокаРеализации из ДеревоДокументов.ПолучитьЭлементы() Цикл
		ПометкаРеализации = Ложь;
		Для каждого СтрокаФормы из СтрокаРеализации.ПолучитьЭлементы() Цикл
			ТекущаяСтрока = Элементы.ТипыПечатныхФорм.ТекущиеДанные;
			Если СтрокаФормы.Документ = ТекущаяСтрока.ТипПечатнойФормы Тогда
				СтрокаФормы.Пометка = ТекущаяСтрока.Пометка;
			КонецЕсли;
			ПометкаРеализации = ПометкаРеализации Или СтрокаФормы.Пометка;
		КонецЦикла;
		СтрокаРеализации.Пометка = ПометкаРеализации;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацииУстановитьПометки(Команда)
	Для каждого СтрокаТЗ из Объект.ОтгрузочныеДокументы Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РеализацииСнятьПометки(Команда)
	Для каждого СтрокаТЗ из Объект.ОтгрузочныеДокументы Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипыПФУстановитьПометки(Команда)
	Для каждого СтрокаТЗ из ТипыПечатныхФорм Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипыПФСнятьПометки(Команда)
	Для каждого СтрокаТЗ из ТипыПечатныхФорм Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПодобратьКоличествоДляПечати_ЭДО(Контрагент, ТипПечатнойФормы, КоличествоЭкземпляровПечати, Приоритет)  
	//Для Контрагентов у которых установлен признак  Лео_КлиентEDI..
	Если Контрагент.Лео_КлиентEDI И Приоритет=1 Тогда  
		Если ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("3_Счет на оплату") Тогда	
			Возврат 1;	
		ИначеЕсли ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("5_Товарная накладная") Тогда	
			Возврат 0;
		ИначеЕсли ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("6_1_Счет-фактура") Тогда	
			Возврат 0;
		ИначеЕсли ТипПечатнойФормы = Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.НайтиПоНаименованию("6_3_УПД") И НЕ ПроверитьПечать(Контрагент,Приоритет) Тогда	
			Возврат 2;
		КонецЕсли;
	КонецЕсли;
	Возврат КоличествоЭкземпляровПечати;	
КонецФункции       

&НаСервере
Функция ПроверитьПечать(Контрагент,Приоритет)            
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	0 КАК Приоритет,
	            	 	|	НастройкиПечати.ТипПечатнойФормы КАК ТипПечатнойФормы,
	            	 	|	НастройкиПечати.Использовать КАК Использовать,
	            	 	|	НастройкиПечати.ПечатнаяФорма КАК ПечатнаяФорма,
	            	 	|	НастройкиПечати.КоличествоЭкземпляровПечати КАК КоличествоЭкземпляровПечати,
	            	 	|	НастройкиПечати.КлючПараметровПечати КАК КлючПараметровПечати,
	            	 	|	НастройкиПечати.ВыводитьГрузополучателя КАК ВыводитьГрузополучателя,
	            	 	|	НастройкиПечати.ВидАдресаГрузополучателя КАК ВидАдресаГрузополучателя,
	            	 	|	НастройкиПечати.ВидАдресаДоставки КАК ВидАдресаДоставки,
	            	 	|	НастройкиПечати.ВыводитьАдресДоставки КАК ВыводитьАдресДоставки
	            	 	|ИЗ
	            	 	|	РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних(&КонецПериода, ) КАК НастройкиПечати
	            	 	|ГДЕ
	            	 	|	НастройкиПечати.Контрагент = &Контрагент
	            	 	|	И НЕ НастройкиПечати.КоличествоЭкземпляровПечати = 0
	            	 	|	И НастройкиПечати.Использовать";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
